In [1]:
import sqlalchemy as sa
import pandas as pd
import datetime as dt
import numpy as np
import os
from openpyxl import load_workbook

In [2]:
engine = sa.create_engine("mssql+pymssql://username:#password@server/database", echo=True)

In [8]:
df = pd.read_excel('February 2022/Catalog-Consignment 02-04-2022 MASTER.xlsx', sheet_name=1)
df = df.rename(columns={"Loc": 'loc', 'Item ID': 'item_id', 'QOH': 'qoh', 'Min':'min', 'Max':'max', 'Average FIFO Cost':'fifo'}).drop('spa_cost', 1)
df.to_sql('aaron_temp_table', con=engine, if_exists='replace')
df

2022-02-10 14:44:14,488 INFO sqlalchemy.engine.base.Engine SELECT [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA], [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_NAME], [INFORMATION_SCHEMA].[COLUMNS].[IS_NULLABLE], [INFORMATION_SCHEMA].[COLUMNS].[DATA_TYPE], [INFORMATION_SCHEMA].[COLUMNS].[ORDINAL_POSITION], [INFORMATION_SCHEMA].[COLUMNS].[CHARACTER_MAXIMUM_LENGTH], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_PRECISION], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_SCALE], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_DEFAULT], [INFORMATION_SCHEMA].[COLUMNS].[COLLATION_NAME]
FROM [INFORMATION_SCHEMA].[COLUMNS]
WHERE [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME] = CAST(%(table_name_1)s AS NVARCHAR(max)) AND [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA] = CAST(%(table_schema_1)s AS NVARCHAR(max))
2022-02-10 14:44:14,489 INFO sqlalchemy.engine.base.Engine {'table_name_1': 'aaron_temp_table', 'table_schema_1': 'dbo'}
2022-02-10 14:44:14,577 INFO sqlalchemy.engine.base.Engine SELECT [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA], [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_NAME], [INFORMATION_SCHEMA].[COLUMNS].[IS_NULLABLE], [INFORMATION_SCHEMA].[COLUMNS].[DATA_TYPE], [INFORMATION_SCHEMA].[COLUMNS].[ORDINAL_POSITION], [INFORMATION_SCHEMA].[COLUMNS].[CHARACTER_MAXIMUM_LENGTH], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_PRECISION], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_SCALE], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_DEFAULT], [INFORMATION_SCHEMA].[COLUMNS].[COLLATION_NAME]
FROM [INFORMATION_SCHEMA].[COLUMNS]
WHERE [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME] = CAST(%(table_name_1)s AS NVARCHAR(max)) AND [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA] = CAST(%(table_schema_1)s AS NVARCHAR(max))
2022-02-10 14:44:14,578 INFO sqlalchemy.engine.base.Engine {'table_name_1': 'aaron_temp_table', 'table_schema_1': 'dbo'}
2022-02-10 14:44:14,587 INFO sqlalchemy.engine.base.Engine SELECT [INFORMATION_SCHEMA].[TABLES].[TABLE_NAME]
FROM [INFORMATION_SCHEMA].[TABLES]
WHERE [INFORMATION_SCHEMA].[TABLES].[TABLE_SCHEMA] = CAST(%(table_schema_1)s AS NVARCHAR(max)) AND [INFORMATION_SCHEMA].[TABLES].[TABLE_TYPE] = CAST(%(table_type_1)s AS NVARCHAR(max)) ORDER BY [INFORMATION_SCHEMA].[TABLES].[TABLE_NAME]
2022-02-10 14:44:14,587 INFO sqlalchemy.engine.base.Engine {'table_schema_1': 'dbo', 'table_type_1': 'BASE TABLE'}

<ipython-input-8-18f4d403f6c8>:2: FutureWarning: In a future version of pandas all arguments of DataFrame.drop except for the argument 'labels' will be keyword-only
  df = df.rename(columns={"Loc": 'loc', 'Item ID': 'item_id', 'QOH': 'qoh', 'Min':'min', 'Max':'max', 'Average FIFO Cost':'fifo'}).drop('spa_cost', 1)

2022-02-10 14:44:14,690 INFO sqlalchemy.engine.base.Engine SELECT [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA], [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_NAME], [INFORMATION_SCHEMA].[COLUMNS].[IS_NULLABLE], [INFORMATION_SCHEMA].[COLUMNS].[DATA_TYPE], [INFORMATION_SCHEMA].[COLUMNS].[ORDINAL_POSITION], [INFORMATION_SCHEMA].[COLUMNS].[CHARACTER_MAXIMUM_LENGTH], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_PRECISION], [INFORMATION_SCHEMA].[COLUMNS].[NUMERIC_SCALE], [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_DEFAULT], [INFORMATION_SCHEMA].[COLUMNS].[COLLATION_NAME], sys.computed_columns.definition, sys.computed_columns.is_persisted
FROM [INFORMATION_SCHEMA].[COLUMNS] LEFT OUTER JOIN sys.computed_columns ON sys.computed_columns.object_id = object_id([INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA] + CAST(%(table_schema_1)s AS NVARCHAR(max)) + [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME]) AND [INFORMATION_SCHEMA].[COLUMNS].[COLUMN_NAME] = sys.computed_columns.name
WHERE [INFORMATION_SCHEMA].[COLUMNS].[TABLE_NAME] = CAST(%(table_name_1)s AS NVARCHAR(max)) AND [INFORMATION_SCHEMA].[COLUMNS].[TABLE_SCHEMA] = CAST(%(table_schema_2)s AS NVARCHAR(max)) ORDER BY [INFORMATION_SCHEMA].[COLUMNS].[ORDINAL_POSITION]
2022-02-10 14:44:14,692 INFO sqlalchemy.engine.base.Engine {'table_schema_1': '.', 'table_name_1': 'aaron_temp_table', 'table_schema_2': 'dbo'}
2022-02-10 14:44:14,734 INFO sqlalchemy.engine.base.Engine sp_columns @table_name = %(table_name)s, @table_owner = %(table_owner)s
2022-02-10 14:44:14,735 INFO sqlalchemy.engine.base.Engine {'table_name': 'aaron_temp_table', 'table_owner': 'dbo'}
2022-02-10 14:44:14,769 INFO sqlalchemy.engine.base.Engine SELECT [C].[COLUMN_NAME], [INFORMATION_SCHEMA].[TABLE_CONSTRAINTS].[CONSTRAINT_TYPE], [C].[CONSTRAINT_NAME]
FROM [INFORMATION_SCHEMA].[KEY_COLUMN_USAGE] AS [C], [INFORMATION_SCHEMA].[TABLE_CONSTRAINTS]
WHERE [INFORMATION_SCHEMA].[TABLE_CONSTRAINTS].[CONSTRAINT_NAME] = [C].[CONSTRAINT_NAME] AND [INFORMATION_SCHEMA].[TABLE_CONSTRAINTS].[TABLE_SCHEMA] = [C].[TABLE_SCHEMA] AND [C].[TABLE_NAME] = CAST(%(table_name_1)s AS NVARCHAR(max)) AND [C].[TABLE_SCHEMA] = CAST(%(table_schema_1)s AS NVARCHAR(max))
2022-02-10 14:44:14,770 INFO sqlalchemy.engine.base.Engine {'table_name_1': 'aaron_temp_table', 'table_schema_1': 'dbo'}
2022-02-10 14:44:14,853 INFO sqlalchemy.engine.base.Engine SELECT [C].[COLUMN_NAME], [R].[TABLE_SCHEMA], [R].[TABLE_NAME], [R].[COLUMN_NAME], [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[CONSTRAINT_NAME], [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[MATCH_OPTION], [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[UPDATE_RULE], [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[DELETE_RULE]
FROM [INFORMATION_SCHEMA].[KEY_COLUMN_USAGE] AS [C], [INFORMATION_SCHEMA].[KEY_COLUMN_USAGE] AS [R], [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS]
WHERE [C].[TABLE_NAME] = CAST(%(table_name_1)s AS NVARCHAR(max)) AND [C].[TABLE_SCHEMA] = CAST(%(table_schema_1)s AS NVARCHAR(max)) AND [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[CONSTRAINT_SCHEMA] = [C].[TABLE_SCHEMA] AND [C].[CONSTRAINT_NAME] = [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[CONSTRAINT_NAME] AND [R].[CONSTRAINT_NAME] = [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[UNIQUE_CONSTRAINT_NAME] AND [R].[CONSTRAINT_SCHEMA] = [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[UNIQUE_CONSTRAINT_SCHEMA] AND [C].[ORDINAL_POSITION] = [R].[ORDINAL_POSITION] ORDER BY [INFORMATION_SCHEMA].[REFERENTIAL_CONSTRAINTS].[CONSTRAINT_NAME], [R].[ORDINAL_POSITION]
2022-02-10 14:44:14,855 INFO sqlalchemy.engine.base.Engine {'table_name_1': 'aaron_temp_table', 'table_schema_1': 'dbo'}
2022-02-10 14:44:15,011 INFO sqlalchemy.engine.base.Engine select ind.index_id, ind.is_unique, ind.name from sys.indexes as ind join sys.tables as tab on ind.object_id=tab.object_id join sys.schemas as sch on sch.schema_id=tab.schema_id where tab.name = CAST(%(tabname)s AS NVARCHAR(max)) and sch.name=CAST(%(schname)s AS NVARCHAR(max)) and ind.is_primary_key=0 and ind.type != 0
2022-02-10 14:44:15,013 INFO sqlalchemy.engine.base.Engine {'tabname': 'aaron_temp_table', 'schname': 'dbo'}
2022-02-10 14:44:15,053 INFO sqlalchemy.engine.base.Engine select ind_col.index_id, ind_col.object_id, col.name from sys.columns as col join sys.tables as tab on tab.object_id=col.object_id join sys.index_columns as ind_col on (ind_col.column_id=col.column_id and ind_col.object_id=tab.object_id) join sys.schemas as sch on sch.schema_id=tab.schema_id where tab.name=CAST(%(tabname)s AS NVARCHAR(max)) and sch.name=CAST(%(schname)s AS NVARCHAR(max))
2022-02-10 14:44:15,055 INFO sqlalchemy.engine.base.Engine {'tabname': 'aaron_temp_table', 'schname': 'dbo'}
2022-02-10 14:44:15,086 INFO sqlalchemy.engine.base.Engine
DROP TABLE aaron_temp_table
2022-02-10 14:44:15,087 INFO sqlalchemy.engine.base.Engine {}
2022-02-10 14:44:15,092 INFO sqlalchemy.engine.base.Engine COMMIT
2022-02-10 14:44:15,095 INFO sqlalchemy.engine.base.Engine
CREATE TABLE aaron_temp_table (
	[index] BIGINT NULL,
	loc BIGINT NULL,
	item_id VARCHAR(max) NULL,
	true_item_id VARCHAR(max) NULL,
	[Helper] VARCHAR(max) NULL,
	qoh FLOAT(53) NULL,
	[Min ] FLOAT(53) NULL,
	max FLOAT(53) NULL,
	fifo FLOAT(53) NULL,
	dist_net FLOAT(53) NULL
)


2022-02-10 14:44:15,096 INFO sqlalchemy.engine.base.Engine {}
2022-02-10 14:44:15,098 INFO sqlalchemy.engine.base.Engine COMMIT
2022-02-10 14:44:15,099 INFO sqlalchemy.engine.base.Engine CREATE INDEX ix_aaron_temp_table_index ON aaron_temp_table ([index])
2022-02-10 14:44:15,100 INFO sqlalchemy.engine.base.Engine {}
2022-02-10 14:44:15,101 INFO sqlalchemy.engine.base.Engine COMMIT
2022-02-10 14:44:15,106 INFO sqlalchemy.engine.base.Engine BEGIN (implicit)
2022-02-10 14:44:15,118 INFO sqlalchemy.engine.base.Engine INSERT INTO aaron_temp_table ([index], loc, item_id, true_item_id, [Helper], qoh, [Min ], max, fifo, dist_net) VALUES (%(index)s, %(loc)s, %(item_id)s, %(true_item_id)s, %(Helper)s, %(qoh)s, %(Min )s, %(max)s, %(fifo)s, %(dist_net)s)
2022-02-10 14:44:15,119 INFO sqlalchemy.engine.base.Engine ({'index': 0, 'loc': 113061, 'item_id': '10/4SO', 'true_item_id': '10/4SO', 'Helper': '113061 10/4SO', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 1, 'loc': 33, 'item_id': '10THHNBLK', 'true_item_id': '10THHNBLK', 'Helper': '33 10THHNBLK', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 2, 'loc': 113061, 'item_id': '10THHNBLK', 'true_item_id': '10THHNBLK', 'Helper': '113061 10THHNBLK', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 3, 'loc': 113880, 'item_id': '10THHNBLK', 'true_item_id': '10THHNBLK', 'Helper': '113880 10THHNBLK', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 4, 'loc': 33, 'item_id': '10THHNBLK25', 'true_item_id': '10THHNBLK25', 'Helper': '33 10THHNBLK25', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 5, 'loc': 109159, 'item_id': '10THHNBLK25', 'true_item_id': '10THHNBLK25', 'Helper': '109159 10THHNBLK25', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 6, 'loc': 113401, 'item_id': '10THHNBLK25', 'true_item_id': '10THHNBLK25', 'Helper': '113401 10THHNBLK25', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 7, 'loc': 113061, 'item_id': '10THHNBLU', 'true_item_id': '10THHNBLU', 'Helper': '113061 10THHNBLU', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}  ... displaying 10 of 1707 total bound parameter sets ...  {'index': 1705, 'loc': 113401, 'item_id': 'TUR FS 4.5-0.3/14.5/NPT/CS11228', 'true_item_id': 'TUR FS 4.5-0.3/14.5/NPT/CS11228', 'Helper': '113401 TUR FS 4.5-0.3/14.5/NPT/CS11228', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None}, {'index': 1706, 'loc': 33, 'item_id': 'YCA-300', 'true_item_id': 'YCA-300', 'Helper': '33 YCA-300', 'qoh': None, 'Min ': None, 'max': None, 'fifo': None, 'dist_net': None})
2022-02-10 14:44:16,067 INFO sqlalchemy.engine.base.Engine COMMIT

,loc,item_id,true_item_id,Helper,qoh,Min,max,fifo,dist_net
0,113061,10/4SO,10/4SO,113061 10/4SO,NaN,NaN,NaN,NaN,NaN
1,33,10THHNBLK,10THHNBLK,33 10THHNBLK,NaN,NaN,NaN,NaN,NaN
2,113061,10THHNBLK,10THHNBLK,113061 10THHNBLK,NaN,NaN,NaN,NaN,NaN
3,113880,10THHNBLK,10THHNBLK,113880 10THHNBLK,NaN,NaN,NaN,NaN,NaN
4,33,10THHNBLK25,10THHNBLK25,33 10THHNBLK25,NaN,NaN,NaN,NaN,NaN
...,...,...,...,...,...,...,...,...,...
1702,33,TB XC 273,TB XC 273,33 TB XC 273,NaN,NaN,NaN,NaN,NaN
1703,113061,TB XC-130,TB XC-130,113061 TB XC-130,NaN,NaN,NaN,NaN,NaN
1704,113401,TUR CMB8151-0,TUR CMB8151-0,113401 TUR CMB8151-0,NaN,NaN,NaN,NaN,NaN
1705,113401,TUR FS 4.5-0.3/14.5/NPT/CS11228,TUR FS 4.5-0.3/14.5/NPT/CS11228,113401 TUR FS 4.5-0.3/14.5/NPT/CS11228,NaN,NaN,NaN,NaN,NaN
1706,33,YCA-300,YCA-300,33 YCA-300,NaN,NaN,NaN,NaN,NaN

In [9]:


# UPDATE  att
# SET att.loc_1_last_cost = fifo_layers.cost
# FROM aaron_temp_table AS att
# INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
# INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
# INNER JOIN (SELECT inv_mast.item_id,  MAX(fifo_layers.date_received) as last_date FROM fifo_layers
#      INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
#      INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
#      WHERE location_id = 1
#      GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
# WHERE location_id = 1 AND 
# fifo_layers.date_received = X.last_date ;


# UPDATE  att
# SET att.loc_116383_last_cost = fifo_layers.cost
# FROM aaron_temp_table AS att
# INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
# INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
# INNER JOIN (SELECT inv_mast.item_id,  MAX(fifo_layers.date_received) as last_date FROM fifo_layers
#      INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
#      INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
#      WHERE location_id = 116383
#      GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
# WHERE location_id = 116383 AND 
# fifo_layers.date_received = X.last_date ;



UpdateQuery = '''


Update att 
SET att.qoh = inv_loc.qty_on_hand,
att.min = inv_loc.inv_min,
att.max = inv_loc.inv_max
FROM aaron_temp_table as att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN inv_loc ON (inv_mast.inv_mast_uid = inv_loc.inv_mast_uid)
WHERE inv_loc.location_id = att.loc ;




UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y' AND
    location_id IN (1, 113401, 109159,113061, 113880)
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE fifo_layers.complete <> 'Y' ;


UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.qty_received))/(Sum(fifo_layers.qty_received)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.date_received > '01/01/2020' AND
    location_id IN (1, 113401, 109159,113061, 113880) 
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE att.fifo IS NULL ;

UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y'
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE fifo_layers.complete <> 'Y' AND
att.fifo IS NULL;


UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid) 
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y'
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE att.fifo IS NULL;




UPDATE  att
SET att.dist_net = inv_sup.cost
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN inventory_supplier AS inv_sup ON (inv_mast.inv_mast_uid = inv_sup.inv_mast_uid)
WHERE inv_sup.primary_supplier_flag = 'Y' ;


'''


engine.execute(UpdateQuery)
SelectATTQ = '''
SELECT * FROM aaron_temp_table ;
'''

SelectQ = pd.read_sql_query(SelectATTQ, engine)
aaron_temp_table = pd.DataFrame(SelectQ)
aaron_temp_table

2022-02-10 14:44:21,131 INFO sqlalchemy.engine.base.Engine


Update att
SET att.qoh = inv_loc.qty_on_hand,
att.min = inv_loc.inv_min,
att.max = inv_loc.inv_max
FROM aaron_temp_table as att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN inv_loc ON (inv_mast.inv_mast_uid = inv_loc.inv_mast_uid)
WHERE inv_loc.location_id = att.loc ;




UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y' AND
    location_id IN (1, 113401, 109159,113061, 113880)
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE fifo_layers.complete <> 'Y' ;


UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.qty_received))/(Sum(fifo_layers.qty_received)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.date_received > '01/01/2020' AND
    location_id IN (1, 113401, 109159,113061, 113880)
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE att.fifo IS NULL ;

UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y'
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE fifo_layers.complete <> 'Y' AND
att.fifo IS NULL;


UPDATE  att
SET att.fifo = X.avg_fifo
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN fifo_layers ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
INNER JOIN (SELECT inv_mast.item_id, (SUM(fifo_layers.cost * fifo_layers.fifo_layer_qty))/(Sum(fifo_layers.fifo_layer_qty)) as avg_fifo FROM fifo_layers
    INNER JOIN inv_mast ON (inv_mast.inv_mast_uid = fifo_layers.inv_mast_uid)
    INNER JOIN aaron_temp_table AS att ON (att.item_id = inv_mast.item_id)
    WHERE fifo_layers.complete <> 'Y'
    GROUP BY  inv_mast.item_id) X ON (att.item_id = X.item_id)
WHERE att.fifo IS NULL;




UPDATE  att
SET att.dist_net = inv_sup.cost
FROM aaron_temp_table AS att
INNER JOIN inv_mast ON (att.item_id = inv_mast.item_id)
INNER JOIN inventory_supplier AS inv_sup ON (inv_mast.inv_mast_uid = inv_sup.inv_mast_uid)
WHERE inv_sup.primary_supplier_flag = 'Y' ;



2022-02-10 14:44:21,133 INFO sqlalchemy.engine.base.Engine {}
2022-02-10 14:44:22,249 INFO sqlalchemy.engine.base.Engine COMMIT
2022-02-10 14:44:22,253 INFO sqlalchemy.engine.base.OptionEngine
SELECT * FROM aaron_temp_table ;

2022-02-10 14:44:22,253 INFO sqlalchemy.engine.base.OptionEngine {}

,index,loc,item_id,true_item_id,Helper,qoh,Min,max,fifo,dist_net
0,0,113061,10/4SO,10/4SO,113061 10/4SO,500.0,250.0,500.0,0.920640,1.429909
1,1,33,10THHNBLK,10THHNBLK,33 10THHNBLK,1500.0,500.0,500.0,0.268886,0.273685
2,2,113061,10THHNBLK,10THHNBLK,113061 10THHNBLK,5500.0,3000.0,8000.0,0.268886,0.273685
3,3,113880,10THHNBLK,10THHNBLK,113880 10THHNBLK,3500.0,3000.0,6000.0,0.268886,0.273685
4,4,33,10THHNBLK25,10THHNBLK25,33 10THHNBLK25,2500.0,2500.0,2500.0,0.237844,0.273685
...,...,...,...,...,...,...,...,...,...,...
1702,1702,33,TB XC 273,TB XC 273,33 TB XC 273,10.0,10.0,10.0,7.514700,9.501600
1703,1703,113061,TB XC-130,TB XC-130,113061 TB XC-130,49.0,10.0,40.0,0.873338,1.418000
1704,1704,113401,TUR CMB8151-0,TUR CMB8151-0,113401 TUR CMB8151-0,84.0,30.0,50.0,30.742857,NaN
1705,1705,113401,TUR FS 4.5-0.3/14.5/NPT/CS11228,TUR FS 4.5-0.3/14.5/NPT/CS11228,113401 TUR FS 4.5-0.3/14.5/NPT/CS11228,74.0,10.0,20.0,9.904054,NaN
1706,1706,33,YCA-300,YCA-300,33 YCA-300,29.0,13.0,36.0,3.750000,NaN

In [10]:
df = {}
i = 1
files = [ f for f in os.listdir('February 2022/SPAS/') if os.path.isfile('February 2022/SPAS/'+ f) ]

for filename in files:
    df[i] = pd.read_excel('February 2022/SPAS/' + filename, usecols=['upc_code', 'item_id', 'dist_net',  'spa_cost', 'spa_source'])
    i += i

ConCat = pd.concat(df, ignore_index=True)
ConCat['dist_net'].fillna(0, inplace=True)
ConCat

,upc_code,item_id,dist_net,spa_cost,spa_source
0,78200193545.0,MER 4/0CBR,35.3173,24.72211,DAV
1,78200193555.0,MER 4/0CCR,62.1336,43.49352,DAV
2,78200193549.0,MER 500CBR,40.4374,28.30618,DAV
3,78200193548.0,MER 500CCR,81.5193,57.06351,DAV
4,78200194075.0,MER AOS-Q,30.7811,21.54677,DAV
...,...,...,...,...,...
281116,4613579779.0,LED LEDRTQ56TRIMDKBZ,29.5,29.50000,Dist. Net
281117,4613579780.0,LED LEDRTQ56TRIMBLK,29.5,29.50000,Dist. Net
281118,4613579782.0,LED LEDRTQ56TRIMSN,29.5,29.50000,Dist. Net
281119,4613579783.0,LED LED10PAR30DIM830NFL2522YGL3WRP,151.41,9.22000,MASE
281120,4613579784.0,LED LED10PAR30DIM830FL4022YGL3WRP,151.41,9.22000,MASE

In [11]:
merged = aaron_temp_table.merge(ConCat[['item_id', 'spa_cost']], how='left', left_on='true_item_id', right_on='item_id',suffixes=('', '_y')).drop(columns=['item_id_y','index']).fillna('')
merged

,loc,item_id,true_item_id,Helper,qoh,Min,max,fifo,dist_net,spa_cost
0,113061,10/4SO,10/4SO,113061 10/4SO,500.0,250.0,500.0,0.92064,1.429909,
1,33,10THHNBLK,10THHNBLK,33 10THHNBLK,1500.0,500.0,500.0,0.268886,0.273685,
2,113061,10THHNBLK,10THHNBLK,113061 10THHNBLK,5500.0,3000.0,8000.0,0.268886,0.273685,
3,113880,10THHNBLK,10THHNBLK,113880 10THHNBLK,3500.0,3000.0,6000.0,0.268886,0.273685,
4,33,10THHNBLK25,10THHNBLK25,33 10THHNBLK25,2500.0,2500.0,2500.0,0.237844,0.273685,
...,...,...,...,...,...,...,...,...,...,...
1703,33,TB XC 273,TB XC 273,33 TB XC 273,10.0,10.0,10.0,7.5147,9.5016,4.845816
1704,113061,TB XC-130,TB XC-130,113061 TB XC-130,49.0,10.0,40.0,0.873338,1.418,0.9289
1705,113401,TUR CMB8151-0,TUR CMB8151-0,113401 TUR CMB8151-0,84.0,30.0,50.0,30.742857,,
1706,113401,TUR FS 4.5-0.3/14.5/NPT/CS11228,TUR FS 4.5-0.3/14.5/NPT/CS11228,113401 TUR FS 4.5-0.3/14.5/NPT/CS11228,74.0,10.0,20.0,9.904054,,
1707,33,YCA-300,YCA-300,33 YCA-300,29.0,13.0,36.0,3.75,,

In [12]:
with pd.ExcelWriter('February 2022/Catalog-Consignment 02-04-2022 MASTER.xlsx', engine='openpyxl', mode='a', if_sheet_exists='replace', index=None) as writer:
    merged.to_excel(writer, sheet_name='Sheet1', index=None)
    writer.save()

<ipython-input-12-58e713b2ecc1>:1: FutureWarning: Use of **kwargs is deprecated, use engine_kwargs instead.
  with pd.ExcelWriter('February 2022/Catalog-Consignment 02-04-2022 MASTER.xlsx', engine='openpyxl', mode='a', if_sheet_exists='replace', index=None) as writer: